request0.xml

<soapenv:Envelope 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ns1="urn:dslforum-org:service:X_AVM-DE_TAM:1">
   <soapenv:Body>
      <ns1:GetMessageList>
         <NewIndex xsi:type="xsd:int">0</NewIndex>
       </ns1:GetMessageList>
</soapenv:Body>
</soapenv:Envelope>
